{
  "success": true,
  "old_file": "2026 Chemistry.pdf",
  "new_file": "2023 Chemistry.pdf",
  "report": {
    "syllabi_diff": [
      {
        "topic": "Experimental Chemistry",
        "status": "modified",
        "change_summary": "Assessed learning outcomes largely retained; NEW syllabus adds narrative context and guiding questions.",
        "old_summary": "Focuses on core lab skills and separation techniques without additional context.",
        "new_summary": "Adds non-assessed context and narrative around experimental planning and investigation aims."
      },
      {
        "topic": "Stoichiometry",
        "status": "modified",
        "change_summary": "NEW syllabus expands mole concept applications to include concentration calculations in different units.",
        "old_summary": "Covers basic mole concept, empirical formula, limiting reagent, and concentration.",
        "new_summary": "Adds molarity variations and contextual calculations for real-lab scenarios."
      },
      {
        "topic": "Chemical Bonding",
        "status": "removed",
        "change_summary": "Learning outcomes for valence electrons, bonding types, and structure-properties link are no longer explicitly listed.",
        "old_summary": "Detailed coverage of ionic, covalent, and metallic bonding including particle models.",
        "new_summary": "Content appears absorbed under 'Structure & Properties of Matter' with no standalone bonding section."
      },
      {
        "topic": "Structure & Properties of Matter",
        "status": "added",
        "change_summary": "Introduces particle model explanations linking microstructure to observed physical/chemical properties.",
        "old_summary": "No equivalent standalone topic; aspects were scattered across bonding and states of matter.",
        "new_summary": "Consolidates bonding, molecular geometry, and material properties under a concept-driven model."
      },
      {
        "topic": "Electrolysis",
        "status": "modified",
        "change_summary": "Assessment scope adjusted: NEW syllabus removes specific industrial case studies (e.g., electroplating) and simplifies electrolytic cell descriptions.",
        "old_summary": "Includes industrial electrolysis applications, copper refining, and electroplating context.",
        "new_summary": "Focuses on core redox processes and decomposition reactions without industrial depth."
      }
    ]
  }
}